src/cf/InformationRegisters/ИсторияРегистрацийВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВНалоговомОргане</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторииВыполненияРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксБП20</Name>
					<Comment>Префикс для формирования номера документов (БП 2.0)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияРегистрацийВНалоговомОргане/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПодчиненныеСтруктурныеЕдиницы(СтруктурныеЕдиницы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(СтруктурныеЕдиницы.ГоловнаяСтруктурнаяЕдиница) Тогда
		
		ПодчиненныеСтруктурныеЕдиницы = СтруктурныеЕдиницы.ПодчиненныеСтруктурныеЕдиницы;
		Если ПодчиненныеСтруктурныеЕдиницы.Количество() =0 Тогда
			Возврат;
		КонецЕсли;
		
		НовыйНаборЗаписей = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурныеЕдиницы.ГоловнаяСтруктурнаяЕдиница);
		НовыйНаборЗаписей.Прочитать();
		ТекущийНабор = НовыйНаборЗаписей.Выгрузить();
		
		Для каждого ПодчиненнаяСтруктурнаяЕдиница Из ПодчиненныеСтруктурныеЕдиницы Цикл
			НовыйНаборЗаписей = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
			НовыйНаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(ПодчиненнаяСтруктурнаяЕдиница);
			НовыйНаборЗаписей.Прочитать();
			ТаблицаИсходногоНабора = НовыйНаборЗаписей.Выгрузить();
			
			// Проверим необходимость записи нового набора.
			Если НЕ ОбщегоНазначения.КоллекцииИдентичны(ТаблицаИсходногоНабора, ТекущийНабор, ,"СтруктурнаяЕдиница") Тогда
				НовыйНаборЗаписей.Очистить();
				
				Для каждого ЗаписьТекущегоНабора Из ТекущийНабор Цикл
					НоваяЗаписьНабора = НовыйНаборЗаписей.Добавить();
					НоваяЗаписьНабора.СтруктурнаяЕдиница = ПодчиненнаяСтруктурнаяЕдиница;
					ЗаполнитьЗначенияСвойств(НоваяЗаписьНабора, ЗаписьТекущегоНабора,, "СтруктурнаяЕдиница");
				КонецЦикла;
				
				НовыйНаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
				НовыйНаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьИсториюРегистрацийВНалоговомОргане() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияРегистрацийВНалоговомОргане.Период
	|ИЗ
	|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		ТекстЗапросаПоРегистрам = "";
		ОписанияРегистров = ЗарплатаКадры.ОписанияРегистровСодержащихРегистрацииВНалоговомОргане();
		
		Для каждого ОписаниеРегистра Из ОписанияРегистров Цикл
			
			Если НЕ ОписаниеРегистра.ЕстьПодразделения Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ТекстЗапросаПоРегистрам) Тогда
				
				ТекстЗапросаПоРегистрам = ТекстЗапросаПоРегистрам + 
					"
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|";
				ТекстПоместить = "";
				
			Иначе
				ТекстПоместить = "ПОМЕСТИТЬ ВТВсеЗарегистрированныеПериоды";
			КонецЕсли;
			
			ТекстЗапросаПоРегистрам = ТекстЗапросаПоРегистрам
				+ "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	НАЧАЛОПЕРИОДА(ВЫБОР КОГДА ИсследуемыйРегистр.Период < ДАТАВРЕМЯ(1900, 1, 1)
				|		ТОГДА ДАТАВРЕМЯ(1900, 1, 1)
				|		ИНАЧЕ ИсследуемыйРегистр.Период
				|	КОНЕЦ, МЕСЯЦ) КАК Период,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ИсследуемыйРегистр.Подразделение.ОбособленноеПодразделение, ЛОЖЬ)
				|			ТОГДА ИсследуемыйРегистр.Подразделение
				|		ИНАЧЕ ИсследуемыйРегистр.Организация
				|	КОНЕЦ КАК СтруктурнаяЕдиница,
				|	ИсследуемыйРегистр.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
				|" + ТекстПоместить + "
				|ИЗ
				|	&ИсследуемыйРегистр КАК ИсследуемыйРегистр";
			
			ТекстЗапросаПоРегистрам = СтрЗаменить(ТекстЗапросаПоРегистрам, "&ИсследуемыйРегистр", ОписаниеРегистра.ПолноеИмяРегистра);
			
		КонецЦикла;
		
		Запрос.Текст = ТекстЗапросаПоРегистрам + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК СтруктурнаяЕдиница,
		|	Организации.РегистрацияВНалоговомОргане
		|ПОМЕСТИТЬ ВТВсеВладельцыРегистрацийВНалоговомОргане
		|ИЗ
		|	Справочник.Организации КАК Организации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка,
		|	ПодразделенияОрганизаций.РегистрацияВНалоговомОргане
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.ОбособленноеПодразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеЗарегистрированныеПериоды.Период,
		|	ВсеЗарегистрированныеПериоды.СтруктурнаяЕдиница,
		|	МАКСИМУМ(ВсеЗарегистрированныеПериоды.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане
		|ПОМЕСТИТЬ ВТВсеИспользуемыеПериоды
		|ИЗ
		|	ВТВсеЗарегистрированныеПериоды КАК ВсеЗарегистрированныеПериоды
		|ГДЕ
		|	ВсеЗарегистрированныеПериоды.РегистрацияВНалоговомОргане <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеЗарегистрированныеПериоды.Период,
		|	ВсеЗарегистрированныеПериоды.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеИспользуемыеПериоды.Период,
		|	ВсеИспользуемыеПериоды.СтруктурнаяЕдиница,
		|	ВсеИспользуемыеПериоды.РегистрацияВНалоговомОргане,
		|	МИНИМУМ(ВсеИспользуемыеПериодыИзменений.Период) КАК ПериодИзменения
		|ПОМЕСТИТЬ ВТИспользуемыеПериодыСПериодомИзменения
		|ИЗ
		|	ВТВсеИспользуемыеПериоды КАК ВсеИспользуемыеПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеИспользуемыеПериоды КАК ВсеИспользуемыеПериодыИзменений
		|		ПО ВсеИспользуемыеПериоды.СтруктурнаяЕдиница = ВсеИспользуемыеПериодыИзменений.СтруктурнаяЕдиница
		|			И ВсеИспользуемыеПериоды.РегистрацияВНалоговомОргане <> ВсеИспользуемыеПериодыИзменений.РегистрацияВНалоговомОргане
		|			И ВсеИспользуемыеПериоды.Период < ВсеИспользуемыеПериодыИзменений.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеИспользуемыеПериоды.Период,
		|	ВсеИспользуемыеПериоды.СтруктурнаяЕдиница,
		|	ВсеИспользуемыеПериоды.РегистрацияВНалоговомОргане
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ИспользуемыеПериодыСПериодомИзменения.Период) КАК Период,
		|	ИспользуемыеПериодыСПериодомИзменения.СтруктурнаяЕдиница,
		|	ИспользуемыеПериодыСПериодомИзменения.РегистрацияВНалоговомОргане,
		|	ИспользуемыеПериодыСПериодомИзменения.ПериодИзменения
		|ПОМЕСТИТЬ ВТПериодыИзменений
		|ИЗ
		|	ВТИспользуемыеПериодыСПериодомИзменения КАК ИспользуемыеПериодыСПериодомИзменения
		|
		|СГРУППИРОВАТЬ ПО
		|	ИспользуемыеПериодыСПериодомИзменения.СтруктурнаяЕдиница,
		|	ИспользуемыеПериодыСПериодомИзменения.РегистрацияВНалоговомОргане,
		|	ИспользуемыеПериодыСПериодомИзменения.ПериодИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеВладельцыРегистрацийВНалоговомОргане.СтруктурнаяЕдиница,
		|	ЕСТЬNULL(ПериодыИзменений.РегистрацияВНалоговомОргане, ВсеВладельцыРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
		|	ЕСТЬNULL(ПериодыИзменений.Период, &ПериодПоУмолчанию) КАК Период
		|ИЗ
		|	ВТВсеВладельцыРегистрацийВНалоговомОргане КАК ВсеВладельцыРегистрацийВНалоговомОргане
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыИзменений КАК ПериодыИзменений
		|		ПО ВсеВладельцыРегистрацийВНалоговомОргане.СтруктурнаяЕдиница = ПериодыИзменений.СтруктурнаяЕдиница
		|ГДЕ
		|	(ВсеВладельцыРегистрацийВНалоговомОргане.СтруктурнаяЕдиница ССЫЛКА Справочник.Организации
		|			ИЛИ ВсеВладельцыРегистрацийВНалоговомОргане.СтруктурнаяЕдиница ССЫЛКА Справочник.ПодразделенияОрганизаций
		|				И ВсеВладельцыРегистрацийВНалоговомОргане.СтруктурнаяЕдиница.ОбособленноеПодразделение)";
		
		Запрос.УстановитьПараметр("ПериодПоУмолчанию", НачалоМесяца(ТекущаяДатаСеанса()));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ТаблицаНабора = РезультатЗапроса.Выгрузить();
			
			Набор = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
			Набор.Загрузить(ТаблицаНабора);
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПодчиненныеСтруктурныеЕдиницы = Справочники.ПодразделенияОрганизаций.ПодчиненныеСтруктурныеЕдиницы(Выборка.СтруктурнаяЕдиница);
				ОбновитьПодчиненныеСтруктурныеЕдиницы(ПодчиненныеСтруктурныеЕдиницы);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИсториюРегистрацийВНалоговомОрганеНаДатуОтсчетаПериодическихСведенийСПериодомМесяц() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтсчетаПериодическихСведений", ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница,
		|	МИНИМУМ(ИсторияРегистрацийВНалоговомОргане.Период) КАК Период
		|ПОМЕСТИТЬ ВТМинимальныеПериодыСтруктурныхЕдиниц
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаОтсчетаПериодическихСведений КАК Период,
		|	МинимальныеПериодыСтруктурныхЕдиниц.СтруктурнаяЕдиница,
		|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане
		|ИЗ
		|	ВТМинимальныеПериодыСтруктурныхЕдиниц КАК МинимальныеПериодыСтруктурныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане
		|		ПО МинимальныеПериодыСтруктурныхЕдиниц.СтруктурнаяЕдиница = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
		|			И МинимальныеПериодыСтруктурныхЕдиниц.Период = ИсторияРегистрацийВНалоговомОргане.Период
		|ГДЕ
		|	МинимальныеПериодыСтруктурныхЕдиниц.Период > &ДатаОтсчетаПериодическихСведений";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Набор = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(Выборка.Период);
			Набор.Отбор.СтруктурнаяЕдиница.Установить(Выборка.СтруктурнаяЕдиница);
			
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
			
			Набор.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ДатаОтсчетаПериодическихСведений() Экспорт
	
	Возврат ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений();
	
КонецФункции

#КонецОбласти

#КонецЕсли
